In [1]:
import pandas as pd

In [21]:
names_list=['kunal','anvi','sumit','abhishek']
age_list=[21,21,23,17]
college_list=['bfit','dit','dit','ims']
location_list=['dehradun','dehradun','lucknow','barelly']

In [22]:
students_dict={
    'name':names_list,
    'age':age_list,
    'college':college_list,
    'location':location_list
}

In [23]:
print(students_dict)

{'name': ['kunal', 'anvi', 'sumit', 'abhishek'], 'age': [21, 21, 23, 17], 'college': ['bfit', 'dit', 'dit', 'ims'], 'location': ['dehradun', 'dehradun', 'lucknow', 'barelly']}

In [24]:
students_df=pd.DataFrame(data=students_dict)

In [8]:
students_df

       name age college  location
0     kunal  21    bfit  dehradun
1      anvi  21     dit  dehradun
2     sumit  23     dit   lucknow
3  abhishek  17     ims   barelly

In [9]:
students_df['name']

0       kunal
1        anvi
2       sumit
3    abhishek
Name: name, dtype: object

In [16]:
students_df.name

0       kunal
1        anvi
2       sumit
3    abhishek
Name: name, dtype: object

In [25]:
students_df[students_df['age']>17]

    name  age college  location
0  kunal   21    bfit  dehradun
1   anvi   21     dit  dehradun
2  sumit   23     dit   lucknow

In [27]:
students_df[['name','age']][students_df['age']>3]

       name  age
0     kunal   21
1      anvi   21
2     sumit   23
3  abhishek   17

In [28]:
students_df.shape

(4, 4)

In [29]:
students_df.groupby(['college'])['age'].mean()

college
bfit    21
dit     22
ims     17
Name: age, dtype: int64